class KCSlotItem
  @@data = {
    1 => {
      :name => "12cm単装砲",
      :type => [1, 1, 1, 1]
    },
    2 => {
      :name => "12.7cm連装砲",
      :type => [1, 1, 1, 1]
    },
    3 => {
      :name => "10cm連装高角砲",
      :type => [1, 1, 1, 16]
    },
    4 => {
      :name => "14cm単装砲",
      :type => [1, 1, 2, 2]
    },
    5 => {
      :name => "15.5cm三連装砲",
      :type => [1, 1, 2, 2]
    },
    6 => {
      :name => "20.3cm連装砲",
      :type => [1, 1, 2, 2]
    },
    7 => {
      :name => "35.6cm連装砲",
      :type => [1, 1, 3, 3]
    },
    8 => {
      :name => "41cm連装砲",
      :type => [1, 1, 3, 3]
    },
    9 => {
      :name => "46cm三連装砲",
      :type => [1, 1, 3, 3]
    },
    10 => {
      :name => "12.7cm連装高角砲",
      :type => [1, 2, 4, 16]
    },
    11 => {
      :name => "15.2cm単装砲",
      :type => [1, 2, 4, 4]
    },
    12 => {
      :name => "15.5cm三連装副砲",
      :type => [1, 2, 4, 4]
    },
    13 => {
      :name => "61cm三連装魚雷",
      :type => [2, 3, 5, 5]
    },
    14 => {
      :name => "61cm四連装魚雷",
      :type => [2, 3, 5, 5]
    },
    15 => {
      :name => "61cm四連装(酸素)魚雷",
      :type => [2, 3, 5, 5]
    },
    16 => {
      :name => "九七式艦攻",
      :type => [3, 5, 8, 8]
    },
    17 => {
      :name => "天山",
      :type => [3, 5, 8, 8]
    },
    18 => {
      :name => "流星",
      :type => [3, 5, 8, 8]
    },
    19 => {
      :name => "九六式艦戦",
      :type => [3, 5, 6, 6]
    },
    20 => {
      :name => "零式艦戦21型",
      :type => [3, 5, 6, 6]
    },
    21 => {
      :name => "零式艦戦52型",
      :type => [3, 5, 6, 6]
    },
    22 => {
      :name => "烈風",
      :type => [3, 5, 6, 6]
    },
    23 => {
      :name => "九九式艦爆",
      :type => [3, 5, 7, 7]
    },
    24 => {
      :name => "彗星",
      :type => [3, 5, 7, 7]
    },
    25 => {
      :name => "零式水上偵察機",
      :type => [5, 7, 10, 10]
    },
    26 => {
      :name => "瑞雲",
      :type => [5, 7, 11, 10]
    },
    27 => {
      :name => "13号対空電探",
      :type => [5, 8, 12, 11]
    },
    28 => {
      :name => "22号対水上電探",
      :type => [5, 8, 12, 11]
    },
    29 => {
      :name => "33号対水上電探",
      :type => [5, 8, 12, 11]
    },
    30 => {
      :name => "21号対空電探",
      :type => [5, 8, 13, 11]
    },
    31 => {
      :name => "32号対水上電探",
      :type => [5, 8, 13, 11]
    },
    32 => {
      :name => "14号対空電探",
      :type => [5, 8, 13, 11]
    },
    33 => {
      :name => "改良型艦本式タービン",
      :type => [6, 31, 17, 19]
    },
    34 => {
      :name => "強化型艦本式缶",
      :type => [6, 31, 17, 19]
    },
    35 => {
      :name => "三式弾",
      :type => [4, 28, 18, 12]
    },
    36 => {
      :name => "九一式徹甲弾",
      :type => [4, 25, 19, 13]
    },
    37 => {
      :name => "7.7mm機銃",
      :type => [4, 6, 21, 15]
    },
    38 => {
      :name => "12.7mm単装機銃",
      :type => [4, 6, 21, 15]
    },
    39 => {
      :name => "25mm連装機銃",
      :type => [4, 6, 21, 15]
    },
    40 => {
      :name => "25mm三連装機銃",
      :type => [4, 6, 21, 15]
    },
    41 => {
      :name => "甲標的",
      :type => [2, 4, 22, 5]
    },
    42 => {
      :name => "応急修理要員",
      :type => [6, 30, 23, 14]
    },
    43 => {
      :name => "応急修理女神",
      :type => [6, 30, 23, 14]
    },
    44 => {
      :name => "九四式爆雷投射機",
      :type => [7, 32, 15, 17]
    },
    45 => {
      :name => "三式爆雷投射機",
      :type => [7, 32, 15, 17]
    },
    46 => {
      :name => "九三式水中聴音機",
      :type => [7, 10, 14, 18]
    },
    47 => {
      :name => "三式水中探信儀",
      :type => [7, 10, 14, 18]
    },
    48 => {
      :name => "12.7cm単装高角砲",
      :type => [1, 1, 1, 16]
    },
    49 => {
      :name => "25mm単装機銃",
      :type => [4, 6, 21, 15]
    },
    50 => {
      :name => "20.3cm(3号)連装砲",
      :type => [1, 1, 2, 2]
    },
    51 => {
      :name => "12cm30連装噴進砲",
      :type => [4, 29, 21, 15]
    },
    52 => {
      :name => "流星改",
      :type => [3, 5, 8, 8]
    },
    53 => {
      :name => "烈風改",
      :type => [3, 5, 6, 6]
    },
    54 => {
      :name => "彩雲",
      :type => [5, 7, 9, 9]
    },
    55 => {
      :name => "紫電改二",
      :type => [3, 5, 6, 6]
    },
    56 => {
      :name => "震電改",
      :type => [3, 5, 6, 6]
    },
    57 => {
      :name => "彗星一二型甲",
      :type => [3, 5, 7, 7]
    },
    58 => {
      :name => "61cm五連装(酸素)魚雷",
      :type => [2, 3, 5, 5]
    },
    59 => {
      :name => "零式水上観測機",
      :type => [5, 7, 10, 10]
    },
    60 => {
      :name => "零式艦戦62型(爆戦)",
      :type => [3, 5, 7, 7]
    },
    61 => {
      :name => "二式艦上偵察機",
      :type => [5, 7, 9, 9]
    },
    62 => {
      :name => "試製晴嵐",
      :type => [5, 7, 11, 10]
    },
    63 => {
      :name => "12.7cm連装砲B型改二",
      :type => [1, 1, 1, 1]
    },
    64 => {
      :name => "Ju87C改",
      :type => [3, 5, 7, 7]
    },
    65 => {
      :name => "15.2cm連装砲",
      :type => [1, 1, 2, 2]
    },
    66 => {
      :name => "8cm高角砲",
      :type => [1, 2, 4, 16]
    },
    67 => {
      :name => "53cm艦首(酸素)魚雷",
      :type => [2, 3, 5, 5]
    },
    68 => {
      :name => "大発動艇",
      :type => [8, 14, 24, 20]
    },
    69 => {
      :name => "カ号観測機",
      :type => [3, 15, 25, 21]
    },
    70 => {
      :name => "三式指揮連絡機(対潜)",
      :type => [3, 16, 26, 22]
    },
    71 => {
      :name => "10cm連装高角砲(砲架)",
      :type => [1, 2, 4, 16]
    },
    72 => {
      :name => "増設バルジ(中型艦)",
      :type => [6, 17, 27, 23]
    },
    73 => {
      :name => "増設バルジ(大型艦)",
      :type => [6, 17, 28, 23]
    },
    74 => {
      :name => "探照灯",
      :type => [8, 18, 29, 24]
    },
    75 => {
      :name => "ドラム缶(輸送用)",
      :type => [9, 19, 30, 25]
    },
    76 => {
      :name => "38cm連装砲",
      :type => [1, 1, 3, 3]
    },
    77 => {
      :name => "15cm連装副砲",
      :type => [1, 2, 4, 4]
    },
    78 => {
      :name => "12.7cm単装砲",
      :type => [1, 1, 1, 1]
    },
    79 => {
      :name => "瑞雲(六三四空)",
      :type => [5, 7, 11, 10]
    },
    80 => {
      :name => "瑞雲12型",
      :type => [5, 7, 11, 10]
    },
    81 => {
      :name => "瑞雲12型(六三四空)",
      :type => [5, 7, 11, 10]
    },
    82 => {
      :name => "九七式艦攻(九三一空)",
      :type => [3, 5, 8, 8]
    },
    83 => {
      :name => "天山(九三一空)",
      :type => [3, 5, 8, 8]
    },
    84 => {
      :name => "2cm 四連装FlaK 38",
      :type => [4, 6, 21, 15]
    },
    85 => {
      :name => "3.7cm FlaK M42",
      :type => [4, 6, 21, 15]
    },
    86 => {
      :name => "艦艇修理施設",
      :type => [10, 20, 31, 26]
    },
    87 => {
      :name => "新型高温高圧缶",
      :type => [6, 31, 17, 19]
    },
    88 => {
      :name => "22号対水上電探改四",
      :type => [5, 8, 12, 11]
    },
    89 => {
      :name => "21号対空電探改",
      :type => [5, 8, 13, 11]
    },
    90 => {
      :name => "20.3cm(2号)連装砲",
      :type => [1, 1, 2, 2]
    },
    91 => {
      :name => "12.7cm連装高角砲(後期型)",
      :type => [1, 2, 1, 16]
    },
    92 => {
      :name => "毘式40mm連装機銃",
      :type => [4, 6, 21, 15]
    },
    93 => {
      :name => "九七式艦攻(友永隊)",
      :type => [3, 5, 8, 8]
    },
    94 => {
      :name => "天山一二型(友永隊)",
      :type => [3, 5, 8, 8]
    },
    95 => {
      :name => "潜水艦53cm艦首魚雷(8門)",
      :type => [2, 3, 32, 5]
    },
    96 => {
      :name => "零式艦戦21型(熟練)",
      :type => [3, 5, 6, 6]
    },
    97 => {
      :name => "九九式艦爆(熟練)",
      :type => [3, 5, 7, 7]
    },
    98 => {
      :name => "九七式艦攻(熟練)",
      :type => [3, 5, 8, 8]
    },
    99 => {
      :name => "九九式艦爆(江草隊)",
      :type => [3, 5, 7, 7]
    },
    100 => {
      :name => "彗星(江草隊)",
      :type => [3, 5, 7, 7]
    },
    101 => {
      :name => "照明弾",
      :type => [11, 21, 33, 27]
    },
    102 => {
      :name => "九八式水上偵察機(夜偵)",
      :type => [5, 7, 10, 10]
    },
    103 => {
      :name => "試製35.6cm三連装砲",
      :type => [1, 1, 3, 3]
    },
    104 => {
      :name => "35.6cm連装砲(ダズル迷彩)",
      :type => [1, 1, 3, 3]
    },
    105 => {
      :name => "試製41cm三連装砲",
      :type => [1, 1, 3, 3]
    },
    106 => {
      :name => "13号対空電探改",
      :type => [5, 8, 12, 11]
    },
    107 => {
      :name => "艦隊司令部施設",
      :type => [12, 22, 34, 28]
    },
    108 => {
      :name => "熟練艦載機整備員",
      :type => [13, 23, 35, 29]
    },
    109 => {
      :name => "零戦52型丙(六〇一空)",
      :type => [3, 5, 6, 6]
    },
    110 => {
      :name => "烈風(六〇一空)",
      :type => [3, 5, 6, 6]
    },
    111 => {
      :name => "彗星(六〇一空)",
      :type => [3, 5, 7, 7]
    },
    112 => {
      :name => "天山(六〇一空)",
      :type => [3, 5, 8, 8]
    },
    113 => {
      :name => "流星(六〇一空)",
      :type => [3, 5, 8, 8]
    },
    114 => {
      :name => "38cm連装砲改",
      :type => [1, 1, 3, 3]
    },
    115 => {
      :name => "Ar196改",
      :type => [5, 7, 10, 10]
    },
    116 => {
      :name => "一式徹甲弾",
      :type => [4, 25, 19, 13]
    },
    117 => {
      :name => "試製46cm連装砲",
      :type => [1, 1, 3, 3]
    },
    118 => {
      :name => "紫雲",
      :type => [5, 7, 10, 10]
    },
    119 => {
      :name => "14cm連装砲",
      :type => [1, 1, 2, 2]
    },
    120 => {
      :name => "91式高射装置",
      :type => [14, 24, 36, 30]
    },
    121 => {
      :name => "94式高射装置",
      :type => [14, 24, 36, 30]
    },
    122 => {
      :name => "10cm連装高角砲+高射装置",
      :type => [1, 1, 1, 16]
    },
    123 => {
      :name => "SKC34 20.3cm連装砲",
      :type => [1, 1, 2, 2]
    },
    124 => {
      :name => "FuMO25 レーダー",
      :type => [5, 8, 13, 11]
    },
    125 => {
      :name => "61cm三連装(酸素)魚雷",
      :type => [2, 3, 5, 5]
    },
    126 => {
      :name => "WG42 (Wurfgerät 42)",
      :type => [15, 26, 37, 31]
    },
    127 => {
      :name => "試製FaT仕様九五式酸素魚雷改",
      :type => [2, 3, 32, 5]
    },
    128 => {
      :name => "試製51cm連装砲",
      :type => [1, 1, 3, 3]
    },
    129 => {
      :name => "熟練見張員",
      :type => [16, 27, 39, 32]
    },
    130 => {
      :name => "12.7cm高角砲+高射装置",
      :type => [1, 2, 4, 16]
    },
    131 => {
      :name => "25mm三連装機銃 集中配備",
      :type => [4, 6, 21, 15]
    },
    132 => {
      :name => "零式水中聴音機",
      :type => [7, 10, 40, 18]
    },
    133 => {
      :name => "381mm/50 三連装砲",
      :type => [1, 1, 3, 3]
    },
    134 => {
      :name => "OTO 152mm三連装速射砲",
      :type => [1, 2, 4, 4]
    },
    135 => {
      :name => "90mm単装高角砲",
      :type => [1, 2, 4, 16]
    },
    136 => {
      :name => "プリエーゼ式水中防御隔壁",
      :type => [6, 17, 28, 23]
    },
    137 => {
      :name => "381mm/50 三連装砲改",
      :type => [1, 1, 3, 3]
    },
    138 => {
      :name => "二式大艇",
      :type => [17, 33, 41, 33]
    },
    139 => {
      :name => "15.2cm連装砲改",
      :type => [1, 1, 2, 2]
    },
    140 => {
      :name => "96式150cm探照灯",
      :type => [8, 18, 42, 24]
    },
    141 => {
      :name => "32号対水上電探改",
      :type => [5, 8, 13, 11]
    },
    142 => {
      :name => "15m二重測距儀+21号電探改二",
      :type => [5, 8, 13, 11]
    },
    143 => {
      :name => "九七式艦攻(村田隊)",
      :type => [3, 5, 8, 8]
    },
    144 => {
      :name => "天山一二型(村田隊)",
      :type => [3, 5, 8, 8]
    },
    145 => {
      :name => "戦闘糧食",
      :type => [18, 34, 43, 34]
    },
    146 => {
      :name => "洋上補給",
      :type => [19, 35, 44, 35]
    },
    147 => {
      :name => "120mm連装砲",
      :type => [1, 1, 1, 1]
    },
    148 => {
      :name => "試製南山",
      :type => [3, 5, 7, 7]
    },
    149 => {
      :name => "四式水中聴音機",
      :type => [7, 10, 14, 18]
    },
    150 => {
      :name => "秋刀魚の缶詰",
      :type => [18, 34, 43, 34]
    },
    151 => {
      :name => "試製景雲(艦偵型)",
      :type => [5, 7, 9, 9]
    },
    152 => {
      :name => "零式艦戦52型(熟練)",
      :type => [3, 5, 6, 6]
    },
    153 => {
      :name => "零戦52型丙(付岩井小隊)",
      :type => [3, 5, 6, 6]
    },
    154 => {
      :name => "零戦62型(爆戦/岩井隊)",
      :type => [3, 5, 7, 7]
    },
    155 => {
      :name => "零戦21型(付岩本小隊)",
      :type => [3, 5, 6, 6]
    },
    156 => {
      :name => "零戦52型甲(付岩本小隊)",
      :type => [3, 5, 6, 6]
    },
    157 => {
      :name => "零式艦戦53型(岩本隊)",
      :type => [3, 5, 6, 6]
    },
    158 => {
      :name => "Bf109T改",
      :type => [3, 5, 6, 6]
    },
    159 => {
      :name => "Fw190T改",
      :type => [3, 5, 6, 6]
    },
    160 => {
      :name => "10.5cm連装砲",
      :type => [1, 2, 4, 16]
    },
    161 => {
      :name => "16inch三連装砲 Mk.7",
      :type => [1, 1, 3, 3]
    },
    162 => {
      :name => "203mm/53 連装砲",
      :type => [1, 1, 2, 2]
    },
    163 => {
      :name => "Ro.43水偵",
      :type => [5, 7, 10, 10]
    },
    164 => {
      :name => "Ro.44水上戦闘機",
      :type => [5, 7, 11, 10]
    }
  }
  
  def self.[](key)
    @@data[key]
  end
end